{"titles":[" Setup Mariadb via Docker With Spring Boot"," Quick Tip: Unicode Characters in Kitty Terminal"," Notes On “The Coaching Habit”"," Increase Your Chances of Getting Your First Developer Job"," Use Jetbrains Mono in VS Code (or: Can You Adjust Line Spacing?)"," Would I Do It Differently?"," Remember to Focus"],"content":"Hello 👋! Thanks for subscribing.\n\n## [Setup Mariadb via Docker With Spring Boot](https://www.rockyourcode.com/setup-mariadb-via-docker-with-spring-boot/)\nPublished on: 2021-05-31\n\ntags: Docker, Tutorial, Java\n\n\n> How to run MariaDB inside Docker and connect to it with Spring Boot\n\n## Docker with MariaDB\n\nWe'll use [yobasystems/alpine-mariadb][alpinemariadb], a lightweight container image using the open-source MariaDB as MySQL alternative.\n\nHere's the docker command:\n\n```bash\ndocker run --name mariadb -p 33067:3306 -v /var/lib/mysql:/var/lib/mysql -e MYSQL_ROOT_PASSWORD=root_pass -d yobasystems/alpine-mariadb\n```\n\nThe command will create a container named `mariadb` with a root password (`root_pass`). You can connect to the database via `localhost` on port 33067.\n\n## Spring Boot\n\nInitialize Spring Boot with the [Spring Initializer][springinitializer].\n\nDependencies: _Spring Data JPA, MariaDB Driver_.\n\nI've also added _Rest Repositories_ and _Lombok_, because my goal was to create a CRUD REST API with Spring.\n\n## Setup User and Database\n\nCreate two scripts.\n\nThe first one is for creating the user (call it `01-user-setup.sql`):\n\n```sql\nCREATE USER 'myuser'@'%' IDENTIFIED BY 'mypass';\n\nGRANT ALL PRIVILEGES ON * . * TO 'myuser'@'%';\n```\n\nThe script creates a new user called `myuser` with the password `mypass` _on all hosts_. Of course, you can change the values to your needs.\n\nBy default, MySQL and MariaDB restrict connections other than to the local machine. The Docker container runs on a separate network. To connect from your local machine, you'll need to use the `%` wildcard as the host.\n\nThe second script creates the database (`02-database-setup.sql`):\n\n```sql\n-- -----------------------------------------------------\n-- Schema ecommerce\n-- -----------------------------------------------------\nDROP SCHEMA IF EXISTS `ecommerce`;\n\nCREATE SCHEMA `ecommerce`;\nUSE `ecommerce` ;\n```\n\nIf you want, you can create your tables here, too. I've omitted the additional setup here.\n\nNow, let's run these scripts via docker:\n\n```bash\ndocker exec -i mariadb sh -c 'mysql --host=localhost --user=root --password=root_pass' < 01-user-setup.sql\n```\n\nAnd the database schema:\n\n```bash\ndocker exec -i mariadb sh -c 'mysql --host=localhost --user=root --password=root_pass' < 02-database-setup.sql\n```\n\nExplanation:\n\n`exec -i mariadb`: run a command in a running container with stdin (`-i`) — we named the database container `mariadb`\n\n`sh -c`: run a shell script with a command string operand\n\n`'mysql --host=localhost --user=root --password=root_pass'`: this is the command we are running _inside_ the container\n\n`< 01-user-setup.sql`: read the file from stdin (on your local computer)\n\n## Connect Spring\n\nFind the `src/main/resources/application.properties` file in your Spring project and replace it with the following content.\n\n```java\nspring.datasource.driver-class-name=org.mariadb.jdbc.Driver\n# connect via localhost on port 33067\nspring.datasource.url=jdbc:mariadb://localhost:33067/ecommerce?useSSL=false&useUnicode=yes&characterEncoding=UTF-8&allowPublicKeyRetrieval=true&serverTimezone=UTC\nspring.datasource.username=myuser\nspring.datasource.password=mypass\n\nspring.jpa.properties.hibernate.dialect=org.hibernate.dialect.MariaDB103Dialect\n\n# use update for development\n# see https://stackoverflow.com/questions/42135114/how-does-spring-jpa-hibernate-ddl-auto-property-exactly-work-in-spring\nspring.jpa.hibernate.ddl-auto=update\n\nspring.data.rest.base-path=/api\n```\n\nMy MariaDB version is `10.5.9`, if your version is higher, you might need to adjust the hibernate dialect to [a higher version](https://stackoverflow.com/questions/37066024/what-is-the-mariadb-dialect-class-name-for-hibernate).\n\nYou should now be able to connect to the database.\n\nI run the application via Maven like so:\n\n```bash\nmvn spring:boot run\n```\n\n## Links\n\n- [DockerHub MariaDB from yobasystems][alpinemariadb]\n- [Spring Boot][springboot]\n\n{{<rawhtml>}}<small><em>image credit: <a href=\"https://unsplash.com/photos/NQ6Lh81BTRs\">Ash from Moddern Afflatus</a></em></small>{{</rawhtml>}}\n\n[alpinemariadb]: https://hub.docker.com/r/yobasystems/alpine-mariadb/\n[springboot]: https://spring.io/projects/spring-boot\n[springinitializer]: https://start.spring.io/\n\n\n<hr />\n## [Quick Tip: Unicode Characters in Kitty Terminal](https://www.rockyourcode.com/quick-tip-unicode-characters-in-kitty-terminal/)\nPublished on: 2021-05-30\n\ntags: TIL, DevTools\n\n\nYou can insert unicode characters by name, hex code, recently used or an editable favorites list. Press **ctrl+shift+u** to start the unicode input widget.\n\n![Unicode Input](https://sw.kovidgoyal.net/kitty/_images/unicode.png \"Unicode input widget\")\n\nI originally used the excellent [unicode.vim][unicode.vim] for inserting Unicode into Vim, but with Kitty this plugin is not necessary anymore.\n\n## Source\n\n- [Kitty Terminal][kitty]\n- [Kitty Terminal: Unicode input][kunicode]\n\n[kunicode]: https://sw.kovidgoyal.net/kitty/kittens/unicode-input.html\n[kitty]: https://sw.kovidgoyal.net/kitty/\n[unicode.vim]: https://www.vim.org/scripts/script.php?script_id=2822\n\n\n<hr />\n## [Notes On “The Coaching Habit”](https://www.rockyourcode.com/notes-on-the-coaching-habit/)\nPublished on: 2021-05-29\n\ntags: Notes\n\n\n## 🚀 The Book in 3 Sentences\n\nStay curious a little bit longer, say less, and ask more questions.\n\nYour advice is not as good as you think it is.\n\nThe book offers a toolkit to become a better leader by giving you a framework of principles and questions.\n\n## 🎨 Impressions\n\nIt's a short book which explains each concept individually, and then offers an actionable script to help you change your behavior. Easy to read.\n\n### Who Should Read It?\n\n“The Coaching Habit” is a book for leaders and managers, but I've found the attitude and questions useful in everyday life, too.\n\n## ☘️ How the Book Changed Me\n\nI've started an effort to become a better listener. I love to talk, so it's hard for me to ask questions and to embrace the silence.  \nSince sprinkling in a few of the 7 questions into my conversations, I've realized that a good question can be very powerful.  \nI've also found the tips on how to set boundaries very helpful and try to at least think about my limits before saying yes to something.\n\n## ✍️ My Top 3 Quotes\n\n> Silence is often a measure of success.\n\n> But a **Yes** is nothing without the **No** that gives it boundaries and form.\n\n> The Secret to saying No is to shift the focus and learn how to say Yes more slowly.\n\n## 📒 Notes\n\n- The **3P model**: what to focus on: a project, a person or a pattern of behavior\n- uncover more options by asking questions, the first solution is rarely the best one\n- when people talk about the challenge at hand, it's seldom the actual problem\n- coaching for development (shifts focus to the person trying to solve the problem) vs. coaching for performance (everyday solving-the-problem management)\n- stick to questions starting with “what”\n- if you're not trying to fix things, **you don't need the backstory**\n- we often don't know what we actually want\n- get comfortable with silence\n- “How can I help?” forces your colleague to make a direct and clear request & forces you to leap into action before you know what's needed\n- ask more questions before committing to a Yes, example: “According to what standard does this need to completed? By when?”, \"If I couldn't do all of this, but could do just a part, what part would you have me do?\"\n- “Say Yes to the person, but say No to the task.”\n\n### The 7 Questions\n\n1. The Kickstart Question: “What's On Your Mind?”\n2. The AWE Question: “And What Else?”\n3. The Focus Question: “What's the Real Challenge Here For You?”\n4. The Foundation Question: “What Do You Want?”\n5. The Lazy Question: “How Can I Help?” (Be curious)\n6. The Strategic Question: “If You're Saying Yes to This, What Are You Saying No To?”\n7. The Learning Question: “What Was Most Useful For You?”\n\n## Links\n\n- [The Coaching Habit](https://www.goodreads.com/book/show/29342515-the-coaching-habit) by Michael Bungay Stanier\n- [Ali's Book Notes Template](https://www.notion.so/Non-Fiction-9de89d6ab82e469d8f8dfff471be9bef)\n\n\n<hr />\n## [Increase Your Chances of Getting Your First Developer Job](https://www.rockyourcode.com/increase-your-chances-of-getting-your-first-developer-job/)\nPublished on: 2021-05-28\n\ntags: Lab\n\n\nHere are some ideas on how to break into tech without having a Computer Science degree.\n\nThe following tips are things that _worked for me_. Depending on where you live and your skills, some advice might not work.  \nBut maybe these tips will still give you some ideas.\n\n## Document Your Learning\n\nWrite a blog, create a YouTube channel or publish a podcast. [Put your notes on GitHub][til].\n\nThis habit has two benefits: it helps you to learn better, and it also shows future employers that you are putting in the work.\n\nDon't forget to use Git and [GitHub](https://github.com) to show your code.\n\n## Attend Meetups\n\nThe best way to learn about the tech industry is by talking to people already working as developers.\n\nYou can ask questions, find out what you need to know to get a job in your area, find folks who talk the same “language” as you.\n\nYou also expose yourself to new technologies, as most Meetups feature a tech talk.\n\nYou might be interested in giving a talk. The organizers are always happy if someone volunteers, and you don't have to be an expert. A talk from a beginner's mind is also valuable.\n\n## Build a Good Portfolio\n\nA website that showcases some good-looking projects makes a good impression. Spend a little time on the looks, but don't neglect the code either.\n\nIf possible, don't use a cloned copy from an Udemy course. At least adjust it slightly, add more functionality, improve the UI, etc.\n\nJosh Comeau has free ebook on **[Building an Effective Dev Portfolio][devportfolio]**.\n\n## Know What You Want\n\nI knew I wanted to become a salaried employee, not a freelancer.\n\nThere are also other concerns for a job: commute time, team size, how the company is organized, diversity, what kind of work you'll be doing, expectations for overtime, and so forth.\n\nFor web developers, do you want to work in an agency or rather a product-based company? Most of the time, the agency takes on new client projects.  \nThat means, you'll have the chance to work on different domains and probably with newer technology (“greenfield” projects).  \nWith product-based companies you'll work on parts of the product for a long time, maintaining and updating it constantly. This kind of work offers different challenges and rewards.\n\nThink about what you would like to get out of “getting a job as a developer”. It needs to be a good fit for you, so that you can do your best work.\n\n## Apply For Jobs Even If You Don't Meet All Requirements\n\nMost job boards show a “wishlist” of what the employer (or recruiter) wants. You'll most likely don't fulfill all requirements.  \n\nMost asks are not hard limits. You will get a few rejections for sure, but if you have a solid cover letter and portfolio you can mitigate the missing requirements.\n\nAs an example, having no Computer Science degree does not automatically disqualify you from a job.\n\n## You Might Not Need to Do Whiteboard Challenges\n\nI was very nervous about having to solve algorithm challenges. It's not something that I enjoy, and I did not prepare for it.\n\nAfter the first few interviews I realized that whiteboard coding challenges are rather uncommon here, so I'm glad that I didn't spend my time on preparing for things that I did not need.\n\nI suggest to get a few job interviews to see how the interviewing process works in your area.\n\n## Links\n\n- [Building an Effective Dev Portfolio][devportfolio]\n\n[til]: https://github.com/jbranchaud/til\n[devportfolio]: https://www.joshwcomeau.com/effective-portfolio/\n\n\n<hr />\n## [Use Jetbrains Mono in VS Code (or: Can You Adjust Line Spacing?)](https://www.rockyourcode.com/use-jetbrains-mono-in-vs-code/)\nPublished on: 2021-05-27\n\ntags: DevTools, TIL\n\n\n[VS Code][vscode] is the default editor/IDE at my future day job.\n\nToday I wanted to switch the default font to the free **[JetBrains Mono][jetbrainsmono]** font.\n\nThe font is easy to read and it also comes with font ligatures, a feature that I love for programming.\n\n![JetBrains Mono Font](https://www.jetbrains.com/idea/whatsnew/2020-1/img/jetbrains_mono.png)\n\n## How To Use JetBrains Mono As Your Font With Recommended Settings\n\n### Download the Font\n\nFind the [installation instructions on the official website](https://www.jetbrains.com/lp/mono/#how-to-install).\n\nFor Arch Linux:\n\n```bash\npacman -S ttf-jetbrains-mono\n```\n\n### Line Spacing in VS Code\n\nYou should [open your user settings (settings.json)](https://code.visualstudio.com/docs/getstarted/settings):\n\n```bash\nCommand Palette > Open Settings (JSON)\n```\n\nThe website for the font explains that the recommended settings are a font size of 13 and line spacing of 1.2.\n\nHere's what it should look like in VS Code:\n\n```json\n{\n    \"editor.fontFamily\": \"JetBrains Mono\",\n    \"editor.fontSize\": 13,\n    \"editor.fontLigatures\": true, // optional\n}\n```\n\n**But didn't you tell me to set the line spacing?**\n\nYes, I did. You can set the `editor.lineHeight` in VS Code (which is the same as line spacing). Don't confuse it with `editor.letterSpacing`.\n\n> Line spacing is the vertical distance between lines of text. Most writers use either double-spaced lines or single-spaced lines—nothing in between—because those are the options presented by word processors. [^1]\n\nIn VS Code, `editor.lineHeight` is an absolute value, so setting it to `1.2` does not work. The line height is in [“...in CSS pixels of the amount of space used for lines vertically.”](https://github.com/microsoft/vscode/issues/33968#issuecomment-328780081).\n\nThere's currently an [open issue to allow the user to set line spacing as a relative value](https://github.com/microsoft/vscode/issues/115960), but the feature is not implemented yet.\n\nIt looks like the [default line spacing defaults to 1.35 relative to the font size](https://github.com/microsoft/vscode/issues/115960#issuecomment-840530402).\n\nFor a font size of `13`, setting the value in `editor.lineHeight` to `22` has the same effect as keeping the default (1.35 relative?). I've manually bumped it down to `21`.\n\n\n## Links\n\n- [JetBrains Mono][jetbrainsmono]\n- [Practical Typography][practicaltypography]\n\n[jetbrainsmono]: https://www.jetbrains.com/lp/mono/\n[vscode]: https://code.visualstudio.com/\n[practicaltypography]: https://practicaltypography.com/line-spacing.html\n\n[^1]: [Practical Typography][practicaltypography]\n\n\n<hr />\n## [Would I Do It Differently?](https://www.rockyourcode.com/would-i-do-it-differently/)\nPublished on: 2021-05-26\n\ntags: Thoughts\n\n\nIt took me around 5 years to learn to code and to switch careers.\n\nProgramming started out as a hobby for me when I was on parental leave. I enjoyed learning to code.  \nI didn't feel confident that I could get a job as a web developer.\n\nI had a decent-paying and secure job as a tax officer. One of the perks was being able to work part-time and to work from home, even before the pandemic.  \nIt's a good job if you have younger children.\n\nRecently someone asked me: “What would you do differently if you could go back?”\n\nI answered something along the lines: “More focus. I learned JavaScript as first programming language, but had trouble applying it to solve problems. So I tried different ways to learn how to solve problems programmatically. I learned Racket, Clojure, then went back to Python, took a tour of Elixir and so forth.  \nI could have changed careers earlier if I'd focus more.”\n\nAnd on the one hand, that's true.\n\nAnd on the other hand, it totally neglects my situation.\n\nI needed to have the confidence to know that I can create web applications. At the beginning, I was able to understand code when someone gave it to me. But I was not able to come up with solutions on my own.\n\nI needed the practice, and I also needed to see how different programming languages approached the same problem (a [CRUD web application][crud]).\n\nMy status quo job-wise also played a significant role in my decisions. Leaving the civil service in Germany comes with enormous down-sides (job security, pension).\n\nMy goal was never: “Get a job as a software developer as soon as possible.”\n\nLooking back, I probably wouldn't do anything differently. Every programming language I learned helped me to become a better problem solver.\n\nMost people want to switch careers as fast as possible. For those, a more focused approach makes total sense.\n\n{{<rawhtml>}}<small><em>image credit: <a href=\"https://unsplash.com/photos/J3JMyXWQHXU\">Caleb Jones</a></em></small>{{</rawhtml>}}\n\n[crud]: https://www.codecademy.com/articles/what-is-crud\n\n\n<hr />\n## [Remember to Focus](https://www.rockyourcode.com/remember-to-focus/)\nPublished on: 2021-05-25\n\ntags: Thoughts\n\n\nThis is a reminder for me to focus more.\n\nI easily get distracted by Twitter, Email or Discord.\n\nCal Newport wrote a book about the topic: [Deep Work: Rules for Focused Success in a Distracted World][deepwork]. (Here's a [summary by Derek Sivers][sum].)\n\nI'm notoriously bad at focusing. I sometimes wonder if that comes from having children.\n\nMy daughters constantly interrupt me. That's life. It is also the reason why I'm not a huge fan of “work from home”.  \nWFH during the pandemic was rather “work from home, home-school at the same time, and also care for the bored kindergarden child”.  \nWhile you still get work done, I'm more productive at the office when I don't have to be a caregiver _at the same time_.\n\nThe [Pomodoro technique][pomodoro], a famous time-boxing method, might be one method to bring more structure and focus. It does not help much [with external distractions](https://facilethings.com/blog/en/interruptions-on-pomodoro), though.\n\n![tomato](https://images.unsplash.com/photo-1607305387299-a3d9611cd469?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=640)\n{{<rawhtml>}}<small><em>image credit: <a href=\"https://unsplash.com/photos/OlXUUQedQyM\">Avin CP</a></em></small>{{</rawhtml>}}\n\nI'm going to give the Pomodoro method a try in the next days.\n\n## Links\n\n- [Deep Work: Rules for Focused Success in a Distracted World][deepwork] by Cal Newport\n- [Book Summary of “Deep Work”][sum] by Derek Sivers\n- [Pomodoro Technique][pomodoro]\n\n[deepwork]: https://www.calnewport.com/books/deep-work/\n[sum]: https://sive.rs/book/DeepWork\n[pomodoro]: https://todoist.com/productivity-methods/pomodoro-technique\n\n\n<hr />\n\nThank you for reading my blog posts.\n\nDon't hesitate to reach out via [email](mailto:hi@rockyourcode.com\") or [Twitter](https://twitter.com/hisophiabrandt)!\n"}